{
  "ABOUT": {
    "TITLE": "Über mich",
    "TEXT": "Ihor Shulha ist ein vielseitiger Software Engineer mit umfassender Erfahrung in Backend-Entwicklung, Cloud-Lösungen und hochskalierbaren Architekturen. Mit über 4 Jahren praktischer Erfahrung in internationalen Teams realisierte er robuste Unternehmenssysteme in Finanzen, Gesundheitswesen und digitalen Plattformen. Spezialisierung: Java (8–21), Spring Boot, Microservices, AWS, PostgreSQL. Ihor verfügt außerdem über fundierte Kenntnisse in DevOps, Containerisierung sowie Frontend- und Mobile-Technologien (Angular, Flutter, Kotlin). Er begeistert sich für skalierbare Lösungen, innovative Payment-Integrationen und verbindet einen pragmatischen Entwicklungsansatz mit starker Kommunikationsfähigkeit und Ergebnisorientierung.\n\nStandort: Kassel, Deutschland\nSprachen: Englisch (beruflich), Ukrainisch (Muttersprache)\nKontakt: ihor.shulha8@gmail.com, +49 160 91483423\nLinkedIn: linkedin.com/in/ihorshulha\n\n\"Ich entwickle Software, die echte Geschäftsprobleme löst und mit Ihrem Wachstum skaliert.\""
  },
  "PROJECTS": {
    "TITLE": "Projekte",
    "BACKEND": {
      "TITLE": "Backend",
      "LIST": [
        {
          "TITLE": "Modulare Payment-Plattform",
          "DESC": "Eine robuste, modulare Zahlungsabwicklung mit Anbindung an über 20 Provider, Echtzeitanalysen, Kaskadenzahlungen und Währungsumrechnung.",
          "STACK": "Java 21, Spring Boot, AWS, Webflux, PostgreSQL, Angular",
          "ROLE": "Lösungsarchitekt und leitender Backend-Entwickler"
        },
        {
          "TITLE": "Enterprise Microservices Suite",
          "DESC": "Entwicklung von Microservices für globale SaaS-Produkte in Kommunikation, Medien und Finanzen. CI/CD mit Kubernetes und Jenkins.",
          "STACK": "Java 17, Spring Boot, Kafka, gRPC, AWS S3, Jenkins, Swagger",
          "ROLE": "Lead Backend Engineer, DevOps Integration"
        },
        {
          "TITLE": "Healthcare Data Platform",
          "DESC": "Serviceorientiertes System für sichere Medizindaten und Compliance (Class B, USA). Migration von Legacy zu Cloud, robuste APIs, interne Tools.",
          "STACK": "Java 11/17, Spring Boot, Cassandra, PostgreSQL, Azure DevOps, Docker",
          "ROLE": "Backend-Entwickler, Forschung & Entwicklung"
        },
        {
          "TITLE": "Krypto-Plattform Backend",
          "DESC": "Backend-Kernentwicklung für eine sichere Kryptowährungstrading-Plattform mit Echtzeitdaten und erweiterten Sicherheitsfunktionen.",
          "STACK": "Java 8, Spring Security, PostgreSQL, WebSocket",
          "ROLE": "Backend-Entwickler (Feature-Implementierung, Sicherheit)"
        },
        {
          "TITLE": "Datenanalyse-Service",
          "DESC": "Individueller Analyse-Microservice für Dashboards und Reporting von Zahlungsdaten.",
          "STACK": "Java, Spring Boot, PostgreSQL, Kafka",
          "ROLE": "Lösungsentwickler"
        },
        {
          "TITLE": "Payment-System-Integrationen",
          "DESC": "Adapter für schnelle Integration von Drittanbieter-Gateways, mit 24/7-Verfügbarkeit und Failover.",
          "STACK": "Java, Spring, AWS, REST, SQS",
          "ROLE": "Integrationsleiter"
        }
      ]
    },
    "FULLSTACK": {
      "TITLE": "Fullstack",
      "LIST": [
        {
          "TITLE": "Payment Dashboard Web App",
          "DESC": "Frontend für Finanzteams zur Visualisierung von Zahlungsflüssen, Analysen und Systemzustand.",
          "STACK": "Angular, Spring Boot, AWS",
          "ROLE": "Fullstack-Entwickler"
        },
        {
          "TITLE": "Device Testing Portal",
          "DESC": "Internes Web-Portal für QA zur Prüfung und Validierung von Medizingeräten.",
          "STACK": "Angular, Java, Docker",
          "ROLE": "Fullstack-Entwickler"
        },
        {
          "TITLE": "Admin UI für Krypto-Plattform",
          "DESC": "Feature-reiches Admin-Panel für sicheres Benutzer- und Operationsmanagement.",
          "STACK": "Angular, Spring, PostgreSQL",
          "ROLE": "Fullstack-Entwickler"
        }
      ]
    },
    "MOBILE": {
      "TITLE": "Mobile / Frontend",
      "LIST": [
        {
          "TITLE": "Flutter Mobile Payment Client",
          "DESC": "Cross-Plattform-App für Zahlungsmanagement mit Echtzeitbenachrichtigungen und Transaktionsverfolgung.",
          "STACK": "Flutter, Dart, REST, AWS",
          "ROLE": "Mobile-App-Entwickler"
        },
        {
          "TITLE": "Kotlin Payment Assistant",
          "DESC": "Native Android-Lösung für Zahlungsbenachrichtigungen, Status und Analytics.",
          "STACK": "Kotlin, Spring Boot Backend",
          "ROLE": "Mobile-Entwickler"
        },
        {
          "TITLE": "Responsives Benutzerportal",
          "DESC": "Adaptives Webportal für Endnutzer zur Profilverwaltung und Interaktion mit Business-Services.",
          "STACK": "Angular, REST API",
          "ROLE": "Frontend-Entwickler"
        }
      ]
    }
  }
}