{
  "ABOUT": {
    "TITLE": "About Me",
    "TEXT": "Ihor Shulha is a versatile Software Engineer with deep expertise in backend development, cloud solutions, and high-load architectures. With over 4 years of hands-on experience in international teams, Ihor has delivered robust enterprise systems in finance, healthcare, and digital platforms. Specializing in Java (8–21), Spring Boot, microservices, AWS, and PostgreSQL, he also possesses solid knowledge of DevOps, containerization, and frontend/mobile technologies (Angular, Flutter, Kotlin). Ihor is passionate about designing scalable solutions, integrating modern payment systems, and bringing innovation to every project. He combines a pragmatic engineering mindset with strong communication skills and a focus on results.\n\nLocation: Kassel, Germany\nLanguages: English (professional), Ukrainian (native)\nContact: ihor.shulha8@gmail.com, +49 160 91483423\nLinkedIn: linkedin.com/in/ihorshulha\n\n\"Building software that solves real business problems and scales with your growth.\""
  },
  "PROJECTS": {
    "TITLE": "Projects",
    "BACKEND": {
      "TITLE": "Backend",
      "LIST": [
        {
          "TITLE": "Modular Payment Platform",
          "DESC": "A resilient, modular payment processing system supporting integrations with 20+ providers, real-time analytics, cascading payments, and currency conversion.",
          "STACK": "Java 21, Spring Boot, AWS, Webflux, PostgreSQL, Angular",
          "ROLE": "Solution architect and lead backend engineer"
        },
        {
          "TITLE": "Enterprise Microservices Suite",
          "DESC": "Developed microservices for global SaaS in communication, media, and finance. CI/CD with Kubernetes and Jenkins.",
          "STACK": "Java 17, Spring Boot, Kafka, gRPC, AWS S3, Jenkins, Swagger",
          "ROLE": "Lead backend engineer, DevOps integration"
        },
        {
          "TITLE": "Healthcare Data Platform",
          "DESC": "Service-oriented system for secure medical device data and compliance (Class B, USA). Legacy-to-cloud migration, robust APIs, and internal tools.",
          "STACK": "Java 11/17, Spring Boot, Cassandra, PostgreSQL, Azure DevOps, Docker",
          "ROLE": "Backend developer, research and development"
        },
        {
          "TITLE": "Crypto Platform Backend",
          "DESC": "Core backend for a secure cryptocurrency trading platform with real-time data and advanced security.",
          "STACK": "Java 8, Spring Security, PostgreSQL, WebSocket",
          "ROLE": "Backend developer (feature implementation, security)"
        },
        {
          "TITLE": "Data Analytics Service",
          "DESC": "Custom analytics microservice powering dashboards and business reporting for payment data.",
          "STACK": "Java, Spring Boot, PostgreSQL, Kafka",
          "ROLE": "Solution developer"
        },
        {
          "TITLE": "Payment System Integrations",
          "DESC": "Adapters for fast integration with third-party gateways, ensuring 24/7 availability and failover.",
          "STACK": "Java, Spring, AWS, REST, SQS",
          "ROLE": "Integration lead"
        }
      ]
    },
    "FULLSTACK": {
      "TITLE": "Fullstack",
      "LIST": [
        {
          "TITLE": "Payment Dashboard Web App",
          "DESC": "Frontend for finance teams to visualize payment flows, analytics, and system health.",
          "STACK": "Angular, Spring Boot, AWS",
          "ROLE": "Fullstack developer"
        },
        {
          "TITLE": "Device Testing Portal",
          "DESC": "Internal web app for QA engineers to test and validate medical equipment.",
          "STACK": "Angular, Java, Docker",
          "ROLE": "Fullstack developer"
        },
        {
          "TITLE": "Admin UI for Crypto Platform",
          "DESC": "Feature-rich admin panel for secure user and operations management.",
          "STACK": "Angular, Spring, PostgreSQL",
          "ROLE": "Fullstack developer"
        }
      ]
    },
    "MOBILE": {
      "TITLE": "Mobile / Frontend",
      "LIST": [
        {
          "TITLE": "Flutter Mobile Payment Client",
          "DESC": "Cross-platform app for managing payments with real-time notifications and transaction tracking.",
          "STACK": "Flutter, Dart, REST, AWS",
          "ROLE": "Mobile app developer"
        },
        {
          "TITLE": "Kotlin Payment Assistant",
          "DESC": "Native Android solution for payment notifications, tracking, and analytics.",
          "STACK": "Kotlin, Spring Boot backend",
          "ROLE": "Mobile developer"
        },
        {
          "TITLE": "Responsive User Portal",
          "DESC": "Adaptive web portal for end-users to manage profiles and interact with business services.",
          "STACK": "Angular, REST API",
          "ROLE": "Frontend developer"
        }
      ]
    }
  }
}