{
  "ABOUT": {
    "TITLE": "Про мене",
    "ROLE": "Software Engineer",
    "LOCATION": "",
    "TEXT": "Я інженер-програміст, що спеціалізується на бекенді, і моєю метою є створення надійних, масштабованих систем для складних бізнес-сфер. Мої основні технології — Java, Spring Boot, AWS і PostgreSQL, але я люблю працювати з усім продуктом — від хмарної інфраструктури до фронтенду та мобільних додатків.\n\nПротягом останніх 6 років я запускав SaaS-платформи, високопродуктивні фінтех-рішення та інтеграції IoT — як у складі команди, так і в якості фріланс-консультанта. Мій підхід є прагматичним та орієнтованим на продукт: я дбаю про чистий код, автоматизацію та створення рішень, які мають значення для користувачів та бізнесу.\n\nЯ люблю працювати в міжфункціональних командах, наставляти молодших колег та вивчати нові технології. Якщо у вас є складний проект або ідея для обговорення, давайте зв'яжемося!",
    "EXPERIENCE_BLOCK": ""
  },
  "SKILLS": {
    "TITLE": "Навички",
    "LIST": [
      "Java", "Spring Boot", "Docker", "AWS", "PostgreSQL", "Kafka", "Redis", "Cassandra",
      "Angular", "Flutter", "Kotlin"
    ]
  },
  "PROJECTS": {
  "TITLE": "Проєкти",
  "BACKEND": "Backend-проєкти",
  "FULLSTACK": "Fullstack-проєкти",
  "MOBILE": "Мобільні / Frontend-проєкти",
  "EXPERIENCE": "Досвід штатного розробника описано у розділі Про мене.",
  "LIST": {
    "BACKEND": [
      {
        "NAME": "BillingCloud API",
        "TECH": "Java, Spring Boot, PostgreSQL, Kafka, Docker, AWS",
        "ROLE": "Lead Backend Engineer та Solution Architect",
        "DESC": "Масштабований backend для SaaS-платформи з білінгу для бізнесу. Автоматизація рахунків, керування клієнтами, безпечні платежі та складна аналітика на основі подій Kafka."
      },
      {
        "NAME": "DocuSigner Microservice",
        "TECH": "Java, Spring Boot, Redis, Cassandra, AWS S3",
        "ROLE": "Технічний власник та core-розробник",
        "DESC": "Мікросервіс для безпечного зберігання електронних документів, workflow електронного підпису, архівування. Інтеграція з AWS S3 для шифрування та реального часу перевірок."
      },
      {
        "NAME": "User Identity & Access Manager",
        "TECH": "Java, Spring Boot, Keycloak, PostgreSQL, Redis",
        "ROLE": "Backend-розробник та інтегратор безпеки",
        "DESC": "Централізована система керування ідентифікацією та доступом для розподілених сервісів. Підтримка OAuth2, SSO, RBAC, керування сесіями для корпоративної безпеки."
      },
      {
        "NAME": "Payments Processing Engine",
        "TECH": "Java, Spring Boot, Kafka, PostgreSQL, AWS",
        "ROLE": "Засновник проєкту та головний інженер",
        "DESC": "Високонавантажений платіжний шлюз з детекцією шахрайства в реальному часі, транзакційними повідомленнями через Kafka, стійким API для fintech-додатків."
      },
      {
        "NAME": "Realtime Collaboration Service",
        "TECH": "Java, Spring Boot, WebSocket, Redis, Docker",
        "ROLE": "Backend-архітектор та lead-розробник",
        "DESC": "Backend для сервісу спільного редагування документів та онлайн-дошок. Підтримка low-latency синхронізації, одночасного редагування й аудиту дій."
      },
      {
        "NAME": "IoT Device Event Aggregator",
        "TECH": "Java, Spring Boot, Kafka, Cassandra, Docker, AWS",
        "ROLE": "Технічний консультант (фріланс)",
        "DESC": "Розподілений сервіс для збору й обробки телеметрії IoT-пристроїв. Оптимізований для time-series-даних, пошуку аномалій та хмарного розгортання."
      }
    ],
    "FULLSTACK": [
      {
        "NAME": "SmartTask Flow",
        "TECH": "Java, Spring Boot, Angular, Docker",
        "ROLE": "Fullstack-розробник (дизайн, реалізація, деплой)",
        "DESC": "Fullstack-система для управління задачами та проєктами малих і середніх компаній. Live-дошки, ролі користувачів, аналітичні дашборди, сучасний UI."
      },
      {
        "NAME": "eCommerce Admin Suite",
        "TECH": "Java, Spring Boot, Angular, PostgreSQL, Docker",
        "ROLE": "Fullstack-розробник та інтегратор API",
        "DESC": "Адмін-панель для керування каталогами товарів, замовленнями та аналітикою клієнтів інтернет-магазинів. Безпечна автентифікація, архітектура API-first."
      },
      {
        "NAME": "HR Interview Portal",
        "TECH": "Java, Spring Boot, Angular, WebSocket",
        "ROLE": "Lead Fullstack Engineer",
        "DESC": "Платформа для автоматизації онлайн-інтерв’ю, тестів та ранжування кандидатів. Підтримка live-фідбеку та генерації звітів."
      }
    ],
    "MOBILE": [
      {
        "NAME": "Wellness Tracker App",
        "TECH": "Flutter, Firebase, REST API",
        "ROLE": "Mobile-розробник та UI-дизайнер",
        "DESC": "Мобільний застосунок для трекінгу спорту, харчування, сну і настрою із хмарною синхронізацією та push-нотифікаціями."
      },
      {
        "NAME": "MiniCRM Mobile",
        "TECH": "Flutter, Kotlin, Firebase",
        "ROLE": "Власник проєкту та mobile-розробник",
        "DESC": "Легка CRM для команд продажів: контакти, угоди, нагадування та швидкий чат."
      },
      {
        "NAME": "SmartHome Dashboard",
        "TECH": "Angular, REST API",
        "ROLE": "Frontend-розробник (PWA)",
        "DESC": "PWA-додаток для моніторингу та керування пристроями smart home, споживанням енергії та оповіщеннями в реальному часі."
      }
    ]
  }
},
  "CONTACT": {
    "TITLE": "Контакти",
    "GITHUB": "GitHub",
    "LINKEDIN": "LinkedIn",
    "EMAIL": "Електронна пошта",
    "WHATSAPP": "WhatsApp",
    "GITHUB_URL": "https://github.com/andrii-dev",
    "LINKEDIN_URL": "https://linkedin.com/in/andrii-dev",
    "EMAIL_ADDR": "john.engineer@email.com",
    "WHATSAPP_NUM": "+49 123 4567890"
  }
}